content/posts/Gaussian_process.md
+++
title = "Gaussian process"
author = ["Cameron Smith"]
lastmod = 2020-09-20T17:34:32-04:00
slug = "Gaussian_process"
draft = false
+++

## software {#software}


### [Stheno.jl]({{< relref "Sthenojl" >}}) {#stheno-dot-jl--sthenojl-dot-md}

<!--list-separator-->

-  [JuliaCon 2019 | Gaussian Process Probabilistic Programming with Stheno.jl | Will Tebbutt \* YouTube](<https://www.youtube.com/watch?v=OO3BBkGEMV8>)

<!--list-separator-->

-  [JuliaCon 2020 | Fast Gaussian processes for time series | Will Tebbutt \* YouTube](<https://www.youtube.com/watch?v=dysmEpX1QoE>)

<!--list-separator-->

-  <https://discourse.julialang.org/t/gaussian-process-model-with-turing/42453/13>


## references {#references}


### [Gaussian processes for time-series modelling by Roberts, Osborne, Aigrain, et al in 2013]({{< relref "Gaussian_processes_for_time-series_modelling_by_Roberts,_Osborne,_Aigrain,_et_al_in_2013" >}}) {#gaussian-processes-for-time-series-modelling-by-roberts-osborne-aigrain-et-al-in-2013--gaussian-processes-for-time-series-modelling-by-roberts-osborne-aigrain-et-al-in-2013-dot-md}


### [Clustering gene expression time series data using an infinite Gaussian process mixture model by Ian McDowell, Timothy Reddy, Barbara Engelhardt, et al in 2018]({{< relref "Clustering_gene_expression_time_series_data_using_an_infinite_Gaussian_process_mixture_model_by_Ian_McDowell,_Timothy_Reddy,_Barbara_Engelhardt,_et_al_in_2018" >}}) {#clustering-gene-expression-time-series-data-using-an-infinite-gaussian-process-mixture-model-by-ian-mcdowell-timothy-reddy-barbara-engelhardt-et-al-in-2018--clustering-gene-expression-time-series-data-using-an-infinite-gaussian-process-mixture-model-by-ian-mcdowell-timothy-reddy-barbara-engelhardt-et-al-in-2018-dot-md}


### Campbell, K., & Yau, C. (2015). Bayesian Gaussian Process Latent Variable Models for pseudotime inference in single-cell RNA-seq data. <https://doi.org/10.1101/026872> {#campbell-k-dot-and-yau-c-dot--2015--dot-bayesian-gaussian-process-latent-variable-models-for-pseudotime-inference-in-single-cell-rna-seq-data-dot-https-doi-dot-org-10-dot-1101-026872}


### [Bayesian non-parametrics and the probabilistic approach to modelling by Zoubin Ghahramani in 2013]({{< relref "Bayesian_non-parametrics_and_the_probabilistic_approach_to_modelling_by_Zoubin_Ghahramani_in_2013" >}}) {#bayesian-non-parametrics-and-the-probabilistic-approach-to-modelling-by-zoubin-ghahramani-in-2013--bayesian-non-parametrics-and-the-probabilistic-approach-to-modelling-by-zoubin-ghahramani-in-2013-dot-md}


### [Hierarchical Bayesian modelling of gene expression time series across irregularly sampled replicates and clusters by James Hensman, Neil Lawrence, and Magnus Rattray in 2013]({{< relref "Hierarchical_Bayesian_modelling_of_gene_expression_time_series_across_irregularly_sampled_replicates_and_clusters_by_James_Hensman,_Neil_Lawrence,_and_Magnus_Rattray_in_2013" >}}) {#hierarchical-bayesian-modelling-of-gene-expression-time-series-across-irregularly-sampled-replicates-and-clusters-by-james-hensman-neil-lawrence-and-magnus-rattray-in-2013--hierarchical-bayesian-modelling-of-gene-expression-time-series-across-irregularly-sampled-replicates-and-clusters-by-james-hensman-neil-lawrence-and-magnus-rattray-in-2013-dot-md}


##  {#}
